MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL26Z128VFM4/mcu.h
#define OSC0_CR                       (*((volatile uint32_t *)0x40065000))      // OSC Control Register (OSC0_CR)


//*****************************************************************************
//
// Analog-to-digital converter (ADC) registers
//
//*****************************************************************************

#define ADC0_SC1A                     (*((volatile uint32_t *)0x4003B000))      // ADC Status and Control Registers 1 (ADC0_SC1A)
#define ADC0_SC1B                     (*((volatile uint32_t *)0x4003B004))      // ADC Status and Control Registers 1 (ADC0_SC1B)
#define ADC0_CFG1                     (*((volatile uint32_t *)0x4003B008))      // ADC Configuration Register 1 (ADC0_CFG1)
#define ADC0_CFG2                     (*((volatile uint32_t *)0x4003B00C))      // ADC Configuration Register 2 (ADC0_CFG2)
#define ADC0_RA                       (*((volatile uint32_t *)0x4003B010))      // ADC Data Result Register (ADC0_RA)
#define ADC0_RB                       (*((volatile uint32_t *)0x4003B014))      // ADC Data Result Register (ADC0_RB)
#define ADC0_CV1                      (*((volatile uint32_t *)0x4003B018))      // Compare Value Registers (ADC0_CV1)
#define ADC0_CV2                      (*((volatile uint32_t *)0x4003B01C))      // Compare Value Registers (ADC0_CV2)
#define ADC0_SC2                      (*((volatile uint32_t *)0x4003B020))      // Status and Control Register 2 (ADC0_SC2)
#define ADC0_SC3                      (*((volatile uint32_t *)0x4003B024))      // Status and Control Register 3 (ADC0_SC3)
#define ADC0_OFS                      (*((volatile uint32_t *)0x4003B028))      // ADC Offset Correction Register (ADC0_OFS)
#define ADC0_PG                       (*((volatile uint32_t *)0x4003B02C))      // ADC Plus-Side Gain Register (ADC0_PG)
#define ADC0_MG                       (*((volatile uint32_t *)0x4003B030))      // ADC Minus-Side Gain Register (ADC0_MG)
#define ADC0_CLPD                     (*((volatile uint32_t *)0x4003B034))      // ADC Plus-Side General Calibration Value Register (ADC0_CLPD)
#define ADC0_CLPS                     (*((volatile uint32_t *)0x4003B038))      // ADC Plus-Side General Calibration Value Register (ADC0_CLPS)
#define ADC0_CLP4                     (*((volatile uint32_t *)0x4003B03C))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP4)
#define ADC0_CLP3                     (*((volatile uint32_t *)0x4003B040))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP3)
#define ADC0_CLP2                     (*((volatile uint32_t *)0x4003B044))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP2)
#define ADC0_CLP1                     (*((volatile uint32_t *)0x4003B048))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP1)
#define ADC0_CLP0                     (*((volatile uint32_t *)0x4003B04C))      // ADC Plus-Side General Calibration Value Register (ADC0_CLP0)
#define ADC0_CLMD                     (*((volatile uint32_t *)0x4003B054))      // ADC Minus-Side General Calibration Value Register (ADC0_CLMD)
#define ADC0_CLMS                     (*((volatile uint32_t *)0x4003B058))      // ADC Minus-Side General Calibration Value Register (ADC0_CLMS)
#define ADC0_CLM4                     (*((volatile uint32_t *)0x4003B05C))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM4)
#define ADC0_CLM3                     (*((volatile uint32_t *)0x4003B060))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM3)
#define ADC0_CLM2                     (*((volatile uint32_t *)0x4003B064))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM2)
#define ADC0_CLM1                     (*((volatile uint32_t *)0x4003B068))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM1)
#define ADC0_CLM0                     (*((volatile uint32_t *)0x4003B06C))      // ADC Minus-Side General Calibration Value Register (ADC0_CLM0)


//*****************************************************************************
//
// Comparator (CMP) registers
//
//*****************************************************************************

#define CMP0_CR0                      (*((volatile uint32_t *)0x40073000))      // CMP Control Register 0 (CMP0_CR0)
#define CMP0_CR1                      (*((volatile uint32_t *)0x40073001))      // CMP Control Register 1 (CMP0_CR1)
#define CMP0_FPR                      (*((volatile uint32_t *)0x40073002))      // CMP Filter Period Register (CMP0_FPR)
#define CMP0_SCR                      (*((volatile uint32_t *)0x40073003))      // CMP Status and Control Register (CMP0_SCR)
#define CMP0_DACCR                    (*((volatile uint32_t *)0x40073004))      // DAC Control Register (CMP0_DACCR)
#define CMP0_MUXCR                    (*((volatile uint32_t *)0x40073005))      // MUX Control Register (CMP0_MUXCR)


//*****************************************************************************
//
// 12-bit digital-to-analog converter (DAC) registers
//
//*****************************************************************************

#define DAC0_DAT0L                    (*((volatile uint32_t *)0x4003F000))      // DAC Data Low Register
#define DAC0_DAT0H                    (*((volatile uint32_t *)0x4003F001))      // DAC Data High Register
#define DAC0_DAT1L                    (*((volatile uint32_t *)0x4003F002))      // DAC Data Low Register
#define DAC0_DAT1H                    (*((volatile uint32_t *)0x4003F003))      // DAC Data High Register
#define DAC0_SR                       (*((volatile uint32_t *)0x4003F020))      // DAC Status Register
#define DAC0_C0                       (*((volatile uint32_t *)0x4003F021))      // DAC Control Register
#define DAC0_C1                       (*((volatile uint32_t *)0x4003F022))      // DAC Control Register 1
#define DAC0_C2                       (*((volatile uint32_t *)0x4003F023))      // DAC Control Register 2


//*****************************************************************************
//
// Timer/PWM Module (TPM) registers
//
//*****************************************************************************

#define TPM0_SC                       (*((volatile uint32_t *)0x40038000))      // Status and Control (TPM0_SC)
#define TPM0_CNT                      (*((volatile uint32_t *)0x40038004))      // Counter (TPM0_CNT)
#define TPM0_MOD                      (*((volatile uint32_t *)0x40038008))      // Modulo (TPM0_MOD)
#define TPM0_C0SC                     (*((volatile uint32_t *)0x4003800C))      // Channel (n) Status and Control (TPM0_C0SC)
#define TPM0_C0V                      (*((volatile uint32_t *)0x40038010))      // Channel (n) Value (TPM0_C0V)
#define TPM0_C1SC                     (*((volatile uint32_t *)0x40038014))      // Channel (n) Status and Control (TPM0_C1SC)
#define TPM0_C1V                      (*((volatile uint32_t *)0x40038018))      // Channel (n) Value (TPM0_C1V)
#define TPM0_C2SC                     (*((volatile uint32_t *)0x4003801C))      // Channel (n) Status and Control (TPM0_C2SC)
#define TPM0_C2V                      (*((volatile uint32_t *)0x40038020))      // Channel (n) Value (TPM0_C2V)
#define TPM0_C3SC                     (*((volatile uint32_t *)0x40038024))      // Channel (n) Status and Control (TPM0_C3SC)
#define TPM0_C3V                      (*((volatile uint32_t *)0x40038028))      // Channel (n) Value (TPM0_C3V)
#define TPM0_C4SC                     (*((volatile uint32_t *)0x4003802C))      // Channel (n) Status and Control (TPM0_C4SC)
#define TPM0_C4V                      (*((volatile uint32_t *)0x40038030))      // Channel (n) Value (TPM0_C4V)
#define TPM0_C5SC                     (*((volatile uint32_t *)0x40038034))      // Channel (n) Status and Control (TPM0_C5SC)
#define TPM0_C5V                      (*((volatile uint32_t *)0x40038038))      // Channel (n) Value (TPM0_C5V)
#define TPM0_STATUS                   (*((volatile uint32_t *)0x40038050))      // Capture and Compare Status (TPM0_STATUS)
#define TPM0_CONF                     (*((volatile uint32_t *)0x40038084))      // Configuration (TPM0_CONF)
#define TPM1_SC                       (*((volatile uint32_t *)0x40039000))      // Status and Control (TPM1_SC)
#define TPM1_CNT                      (*((volatile uint32_t *)0x40039004))      // Counter (TPM1_CNT)
#define TPM1_MOD                      (*((volatile uint32_t *)0x40039008))      // Modulo (TPM1_MOD)
#define TPM1_C0SC                     (*((volatile uint32_t *)0x4003900C))      // Channel (n) Status and Control (TPM1_C0SC)
#define TPM1_C0V                      (*((volatile uint32_t *)0x40039010))      // Channel (n) Value (TPM1_C0V)
#define TPM1_C1SC                     (*((volatile uint32_t *)0x40039014))      // Channel (n) Status and Control (TPM1_C1SC)
#define TPM1_C1V                      (*((volatile uint32_t *)0x40039018))      // Channel (n) Value (TPM1_C1V)
#define TPM1_C2SC                     (*((volatile uint32_t *)0x4003901C))      // Channel (n) Status and Control (TPM1_C2SC)
#define TPM1_C2V                      (*((volatile uint32_t *)0x40039020))      // Channel (n) Value (TPM1_C2V)
#define TPM1_C3SC                     (*((volatile uint32_t *)0x40039024))      // Channel (n) Status and Control (TPM1_C3SC)
#define TPM1_C3V                      (*((volatile uint32_t *)0x40039028))      // Channel (n) Value (TPM1_C3V)
#define TPM1_C4SC                     (*((volatile uint32_t *)0x4003902C))      // Channel (n) Status and Control (TPM1_C4SC)
#define TPM1_C4V                      (*((volatile uint32_t *)0x40039030))      // Channel (n) Value (TPM1_C4V)
#define TPM1_C5SC                     (*((volatile uint32_t *)0x40039034))      // Channel (n) Status and Control (TPM1_C5SC)
#define TPM1_C5V                      (*((volatile uint32_t *)0x40039038))      // Channel (n) Value (TPM1_C5V)
#define TPM1_STATUS                   (*((volatile uint32_t *)0x40039050))      // Capture and Compare Status (TPM1_STATUS)
#define TPM1_CONF                     (*((volatile uint32_t *)0x40039084))      // Configuration (TPM1_CONF)
#define TPM2_SC                       (*((volatile uint32_t *)0x4003A000))      // Status and Control (TPM2_SC)
#define TPM2_CNT                      (*((volatile uint32_t *)0x4003A004))      // Counter (TPM2_CNT)
#define TPM2_MOD                      (*((volatile uint32_t *)0x4003A008))      // Modulo (TPM2_MOD)
#define TPM2_C0SC                     (*((volatile uint32_t *)0x4003A00C))      // Channel (n) Status and Control (TPM2_C0SC)
#define TPM2_C0V                      (*((volatile uint32_t *)0x4003A010))      // Channel (n) Value (TPM2_C0V)
#define TPM2_C1SC                     (*((volatile uint32_t *)0x4003A014))      // Channel (n) Status and Control (TPM2_C1SC)
#define TPM2_C1V                      (*((volatile uint32_t *)0x4003A018))      // Channel (n) Value (TPM2_C1V)
#define TPM2_C2SC                     (*((volatile uint32_t *)0x4003A01C))      // Channel (n) Status and Control (TPM2_C2SC)
#define TPM2_C2V                      (*((volatile uint32_t *)0x4003A020))      // Channel (n) Value (TPM2_C2V)
#define TPM2_C3SC                     (*((volatile uint32_t *)0x4003A024))      // Channel (n) Status and Control (TPM2_C3SC)
#define TPM2_C3V                      (*((volatile uint32_t *)0x4003A028))      // Channel (n) Value (TPM2_C3V)
#define TPM2_C4SC                     (*((volatile uint32_t *)0x4003A02C))      // Channel (n) Status and Control (TPM2_C4SC)
#define TPM2_C4V                      (*((volatile uint32_t *)0x4003A030))      // Channel (n) Value (TPM2_C4V)
#define TPM2_C5SC                     (*((volatile uint32_t *)0x4003A034))      // Channel (n) Status and Control (TPM2_C5SC)
#define TPM2_C5V                      (*((volatile uint32_t *)0x4003A038))      // Channel (n) Value (TPM2_C5V)
#define TPM2_STATUS                   (*((volatile uint32_t *)0x4003A050))      // Capture and Compare Status (TPM2_STATUS)
#define TPM2_CONF                     (*((volatile uint32_t *)0x4003A084))      // Configuration (TPM2_CONF)


//*****************************************************************************
//
// Periodic interrupt timer (PIT) registers
//
//*****************************************************************************

#define PIT_MCR                       (*((volatile uint32_t *)0x40037000))      // PIT Module Control Register (PIT_MCR)
#define PIT_LTMR64H                   (*((volatile uint32_t *)0x400370E0))      // PIT Upper Lifetime Timer Register (PIT_LTMR64H)
#define PIT_LTMR64L                   (*((volatile uint32_t *)0x400370E4))      // PIT Lower Lifetime Timer Register (PIT_LTMR64L)
#define PIT_LDVAL0                    (*((volatile uint32_t *)0x40037100))      // Timer Load Value Register (PIT_LDVAL0)
#define PIT_CVAL0                     (*((volatile uint32_t *)0x40037104))      // Current Timer Value Register (PIT_CVAL0)
#define PIT_TCTRL0                    (*((volatile uint32_t *)0x40037108))      // Timer Control Register (PIT_TCTRL0)
#define PIT_TFLG0                     (*((volatile uint32_t *)0x4003710C))      // Timer Flag Register (PIT_TFLG0)
#define PIT_LDVAL1                    (*((volatile uint32_t *)0x40037110))      // Timer Load Value Register (PIT_LDVAL1)
#define PIT_CVAL1                     (*((volatile uint32_t *)0x40037114))      // Current Timer Value Register (PIT_CVAL1)
#define PIT_TCTRL1                    (*((volatile uint32_t *)0x40037118))      // Timer Control Register (PIT_TCTRL1)
#define PIT_TFLG1                     (*((volatile uint32_t *)0x4003711C))      // Timer Flag Register (PIT_TFLG1)


//*****************************************************************************
//
// Low-power timer (LPTMR) registers
//
//*****************************************************************************

#define LPTMR0_CSR                    (*((volatile uint32_t *)0x40040000))      // Low Power Timer Control Status Register (LPTMR0_CSR)
#define LPTMR0_PSR                    (*((volatile uint32_t *)0x40040004))      // Low Power Timer Prescale Register (LPTMR0_PSR)
#define LPTMR0_CMR                    (*((volatile uint32_t *)0x40040008))      // Low Power Timer Compare Register (LPTMR0_CMR)
#define LPTMR0_CNR                    (*((volatile uint32_t *)0x4004000C))      // Low Power Timer Counter Register (LPTMR0_CNR)


//*****************************************************************************
//
// Real Time Clock (RTC) registers
//
//*****************************************************************************

#define RTC_TSR                       (*((volatile uint32_t *)0x4003D000))      // RTC Time Seconds Register (RTC_TSR)
#define RTC_TPR                       (*((volatile uint32_t *)0x4003D004))      // RTC Time Prescaler Register (RTC_TPR)
#define RTC_TAR                       (*((volatile uint32_t *)0x4003D008))      // RTC Time Alarm Register (RTC_TAR)
#define RTC_TCR                       (*((volatile uint32_t *)0x4003D00C))      // RTC Time Compensation Register (RTC_TCR)
#define RTC_CR                        (*((volatile uint32_t *)0x4003D010))      // RTC Control Register (RTC_CR)
#define RTC_SR                        (*((volatile uint32_t *)0x4003D014))      // RTC Status Register (RTC_SR)
#define RTC_LR                        (*((volatile uint32_t *)0x4003D018))      // RTC Lock Register (RTC_LR)
#define RTC_IER                       (*((volatile uint32_t *)0x4003D01C))      // RTC Interrupt Enable Register (RTC_IER)


//*****************************************************************************
//
// Universal Serial Bus OTG Controller (USBOTG) registers
//
//*****************************************************************************

#define USB0_PERID                    (*((volatile uint32_t *)0x40072000))      // Peripheral ID register (USB0_PERID)
#define USB0_IDCOMP                   (*((volatile uint32_t *)0x40072004))      // Peripheral ID Complement register (USB0_IDCOMP)
#define USB0_REV                      (*((volatile uint32_t *)0x40072008))      // Peripheral Revision register (USB0_REV)
#define USB0_ADDINFO                  (*((volatile uint32_t *)0x4007200C))      // Peripheral Additional Info register (USB0_ADDINFO)
#define USB0_OTGISTAT                 (*((volatile uint32_t *)0x40072010))      // OTG Interrupt Status register (USB0_OTGISTAT)
#define USB0_OTGICR                   (*((volatile uint32_t *)0x40072014))      // OTG Interrupt Control register (USB0_OTGICR)
#define USB0_OTGSTAT                  (*((volatile uint32_t *)0x40072018))      // OTG Status register (USB0_OTGSTAT)
#define USB0_OTGCTL                   (*((volatile uint32_t *)0x4007201C))      // OTG Control register (USB0_OTGCTL)
#define USB0_ISTAT                    (*((volatile uint32_t *)0x40072080))      // Interrupt Status register (USB0_ISTAT)
#define USB0_INTEN                    (*((volatile uint32_t *)0x40072084))      // Interrupt Enable register (USB0_INTEN)
#define USB0_ERRSTAT                  (*((volatile uint32_t *)0x40072088))      // Error Interrupt Status register (USB0_ERRSTAT)
#define USB0_ERREN                    (*((volatile uint32_t *)0x4007208C))      // Error Interrupt Enable register (USB0_ERREN)
#define USB0_STAT                     (*((volatile uint32_t *)0x40072090))      // Status register (USB0_STAT)
#define USB0_CTL                      (*((volatile uint32_t *)0x40072094))      // Control register (USB0_CTL)
#define USB0_ADDR                     (*((volatile uint32_t *)0x40072098))      // Address register (USB0_ADDR)
#define USB0_BDTPAGE1                 (*((volatile uint32_t *)0x4007209C))      // BDT Page register 1 (USB0_BDTPAGE1)
#define USB0_FRMNUML                  (*((volatile uint32_t *)0x400720A0))      // Frame Number register Low (USB0_FRMNUML)
#define USB0_FRMNUMH                  (*((volatile uint32_t *)0x400720A4))      // Frame Number register High (USB0_FRMNUMH)
#define USB0_TOKEN                    (*((volatile uint32_t *)0x400720A8))      // Token register (USB0_TOKEN)
#define USB0_SOFTHLD                  (*((volatile uint32_t *)0x400720AC))      // SOF Threshold register (USB0_SOFTHLD)
#define USB0_BDTPAGE2                 (*((volatile uint32_t *)0x400720B0))      // BDT Page Register 2 (USB0_BDTPAGE2)
#define USB0_BDTPAGE3                 (*((volatile uint32_t *)0x400720B4))      // BDT Page Register 3 (USB0_BDTPAGE3)
#define USB0_ENDPT0                   (*((volatile uint32_t *)0x400720C0))      // Endpoint Control register (USB0_ENDPT0)
#define USB0_ENDPT1                   (*((volatile uint32_t *)0x400720C4))      // Endpoint Control register (USB0_ENDPT1)
#define USB0_ENDPT2                   (*((volatile uint32_t *)0x400720C8))      // Endpoint Control register (USB0_ENDPT2)
#define USB0_ENDPT3                   (*((volatile uint32_t *)0x400720CC))      // Endpoint Control register (USB0_ENDPT3)
#define USB0_ENDPT4                   (*((volatile uint32_t *)0x400720D0))      // Endpoint Control register (USB0_ENDPT4)
#define USB0_ENDPT5                   (*((volatile uint32_t *)0x400720D4))      // Endpoint Control register (USB0_ENDPT5)
#define USB0_ENDPT6                   (*((volatile uint32_t *)0x400720D8))      // Endpoint Control register (USB0_ENDPT6)
#define USB0_ENDPT7                   (*((volatile uint32_t *)0x400720DC))      // Endpoint Control register (USB0_ENDPT7)
#define USB0_ENDPT8                   (*((volatile uint32_t *)0x400720E0))      // Endpoint Control register (USB0_ENDPT8)
#define USB0_ENDPT9                   (*((volatile uint32_t *)0x400720E4))      // Endpoint Control register (USB0_ENDPT9)
#define USB0_ENDPT10                  (*((volatile uint32_t *)0x400720E8))      // Endpoint Control register (USB0_ENDPT10)
#define USB0_ENDPT11                  (*((volatile uint32_t *)0x400720EC))      // Endpoint Control register (USB0_ENDPT11)
#define USB0_ENDPT12                  (*((volatile uint32_t *)0x400720F0))      // Endpoint Control register (USB0_ENDPT12)
#define USB0_ENDPT13                  (*((volatile uint32_t *)0x400720F4))      // Endpoint Control register (USB0_ENDPT13)
#define USB0_ENDPT14                  (*((volatile uint32_t *)0x400720F8))      // Endpoint Control register (USB0_ENDPT14)
#define USB0_ENDPT15                  (*((volatile uint32_t *)0x400720FC))      // Endpoint Control register (USB0_ENDPT15)
#define USB0_USBCTRL                  (*((volatile uint32_t *)0x40072100))      // USB Control register (USB0_USBCTRL)
#define USB0_OBSERVE                  (*((volatile uint32_t *)0x40072104))      // USB OTG Observe register (USB0_OBSERVE)
#define USB0_CONTROL                  (*((volatile uint32_t *)0x40072108))      // USB OTG Control register (USB0_CONTROL)
#define USB0_USBTRC0                  (*((volatile uint32_t *)0x4007210C))      // USB Transceiver Control register 0 (USB0_USBTRC0)
#define USB0_USBFRMADJUST             (*((volatile uint32_t *)0x40072114))      // Frame Adjust Register (USB0_USBFRMADJUST)


//*****************************************************************************
//
// Serial Peripheral Interface (SPI) registers
//
//*****************************************************************************

#define SPI0_S                        (*((volatile uint32_t *)0x40076000))      // SPI Status Register (SPI0_S)
#define SPI0_BR                       (*((volatile uint32_t *)0x40076001))      // SPI Baud Rate Register (SPI0_BR)
#define SPI0_C2                       (*((volatile uint32_t *)0x40076002))      // SPI Control Register 2 (SPI0_C2)
#define SPI0_C1                       (*((volatile uint32_t *)0x40076003))      // SPI Control Register 1 (SPI0_C1)
#define SPI0_ML                       (*((volatile uint32_t *)0x40076004))      // SPI Match Register low (SPI0_ML)
#define SPI0_MH                       (*((volatile uint32_t *)0x40076005))      // SPI match register high (SPI0_MH)
#define SPI0_DL                       (*((volatile uint32_t *)0x40076006))      // SPI Data Register low (SPI0_DL)
#define SPI0_DH                       (*((volatile uint32_t *)0x40076007))      // SPI data register high (SPI0_DH)
#define SPI0_CI                       (*((volatile uint32_t *)0x4007600A))      // SPI clear interrupt register (SPI0_CI)
#define SPI0_C3                       (*((volatile uint32_t *)0x4007600B))      // SPI control register 3 (SPI0_C3)
#define SPI1_S                        (*((volatile uint32_t *)0x40077000))      // SPI Status Register (SPI1_S)
#define SPI1_BR                       (*((volatile uint32_t *)0x40077001))      // SPI Baud Rate Register (SPI1_BR)
#define SPI1_C2                       (*((volatile uint32_t *)0x40077002))      // SPI Control Register 2 (SPI1_C2)
#define SPI1_C1                       (*((volatile uint32_t *)0x40077003))      // SPI Control Register 1 (SPI1_C1)
#define SPI1_ML                       (*((volatile uint32_t *)0x40077004))      // SPI Match Register low (SPI1_ML)
#define SPI1_MH                       (*((volatile uint32_t *)0x40077005))      // SPI match register high (SPI1_MH)
#define SPI1_DL                       (*((volatile uint32_t *)0x40077006))      // SPI Data Register low (SPI1_DL)
#define SPI1_DH                       (*((volatile uint32_t *)0x40077007))      // SPI data register high (SPI1_DH)
#define SPI1_CI                       (*((volatile uint32_t *)0x4007700A))      // SPI clear interrupt register (SPI1_CI)
#define SPI1_C3                       (*((volatile uint32_t *)0x4007700B))      // SPI control register 3 (SPI1_C3)


//*****************************************************************************
//
// Inter-Integrated Circuit (I2C) registers
//
//*****************************************************************************

