MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL26Z128VFM4/mcu.h
#define TSI0_GENCS                    (*((volatile uint32_t *)0x40045000))      // TSI General Control and Status Register (TSI0_GENCS)
#define TSI0_DATA                     (*((volatile uint32_t *)0x40045004))      // TSI DATA Register (TSI0_DATA)
#define TSI0_TSHD                     (*((volatile uint32_t *)0x40045008))      // TSI Threshold Register (TSI0_TSHD)



//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_PCRn register.
//
//*****************************************************************************

#define ISF                           0x01000000      // Interrupt Status Flag
#define IRQC                          0x00780000      // Interrupt Configuration
#define MUX                           0x00001C00      // Pin Mux Control
#define DSE                           0x00000040      // Drive Strength Enable
#define PFE                           0x00000010      // Passive Filter Enable
#define SRE                           0x00000004      // Slew Rate Enable
#define PE                            0x00000002      // Pull Enable
#define PS                            0x00000001      // Pull Select


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_GPCLR register.
//
//*****************************************************************************

#define GPWE                          0x7FFF80000000      // Global Pin Write Enable
#define GPWD                          0x7FFF8000      // Global Pin Write Data


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_GPCHR register.
//
//*****************************************************************************

#define GPWE                          0x7FFF80000000      // Global Pin Write Enable
#define GPWD                          0x7FFF8000      // Global Pin Write Data


//*****************************************************************************
//
// The following are defines for the bit fields in the PORTx_ISFR register.
//
//*****************************************************************************




//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1 register.
//
//*****************************************************************************

#define USBREGEN                      0x80000000      // USB voltage regulator enable
#define USBSSTBY                      0x40000000      // USB voltage regulator in standby mode during Stop, VLPS, LLS and VLLS modes
#define USBVSTBY                      0x20000000      // USB voltage regulator in standby mode during VLPR and VLPW modes
#define OSC32KSEL                     0x00180000      // 32K Oscillator Clock Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT1CFG register.
//
//*****************************************************************************

#define USSWE                         0x04000000      // USB voltage regulator stop standby write enable
#define UVSWE                         0x02000000      // USB voltage regulator VLP standby write enable
#define URWE                          0x01000000      // USB voltage regulator enable write enable


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT2 register.
//
//*****************************************************************************

#define UART0SRC                      0x18000000      // UART0 Clock Source Select
#define TPMSRC                        0x06000000      // TPM Clock Source Select
#define USBSRC                        0x00040000      // USB clock source select
#define PLLFLLSEL                     0x00010000      // PLL/FLL clock select
#define CLKOUTSEL                     0x00000380      // CLKOUT select
#define RTCCLKOUTSEL                  0x00000010      // RTC Clock Out Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT4 register.
//
//*****************************************************************************

#define TPM2CLKSEL                    0x04000000      // TPM2 External Clock Pin Select
#define TPM1CLKSEL                    0x02000000      // TPM1 External Clock Pin Select
#define TPM0CLKSEL                    0x01000000      // TPM0 External Clock Pin Select
#define TPM2CH0SRC                    0x00100000      // TPM2 Channel 0 Input Capture Source Select
#define TPM1CH0SRC                    0x00180000      // TPM1 channel 0 input capture source select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT5 register.
//
//*****************************************************************************

#define UART2ODE                      0x00040000      // UART2 Open Drain Enable
#define UART1ODE                      0x00020000      // UART1 Open Drain Enable
#define UART0ODE                      0x00010000      // UART0 Open Drain Enable
#define UART1RXSRC                    0x00000040      // UART1 Receive Data Source Select
#define UART1TXSRC                    0x00000060      // UART1 Transmit Data Source Select
#define UART0RXSRC                    0x00000004      // UART0 Receive Data Source Select
#define UART0TXSRC                    0x00000006      // UART0 Transmit Data Source Select


//*****************************************************************************
//
// The following are defines for the bit fields in the SIM_SOPT7 register.
//
//*****************************************************************************

