MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MKL26Z128VFM4/mcu.h
#define DEVICETYPID                   0x7FFFFFFF80000000      // Hardwired to 0x0000_0031.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_PERIPHIDn register.
//
//*****************************************************************************

#define PERIPHID                      0x7FFFFFFF80000000      // Peripheral ID4 is hardwired to 0x0000_0004; ID0 to 0x0000_0032; ID1 to 0x0000_00B9; ID2 to 0x0000_000B; and all the others to 0x0000_0000.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_COMPIDn register.
//
//*****************************************************************************

#define COMPID                        0x7FFFFFFF80000000      // Component ID0 is hardwired to 0x0000_000D; ID1 to 0x0000_0090; ID2 to 0x0000_0005; ID3 to 0x0000_00B1.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_CTRL register.
//
//*****************************************************************************

#define NUMCMP                        0x780000000      // Number of comparators
#define DWTCFGCTRL                    0x7FFFFFF8000000      // DWT configuration controls


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_COMPn register.
//
//*****************************************************************************

#define COMP                          0x7FFFFFFF80000000      // Reference value for comparison


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_MASKn register.
//
//*****************************************************************************

#define Reserved                      0x3FFFFFF80000000      // This read-only field is reserved and always has the value 0
#define MASK                          0x000001F0      // The value of the ignore mask, 0-31 bits, is applied to address range matching


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_FCT0 register.
//
//*****************************************************************************

#define Reserved                      0x3F80000000      // This read-only field is reserved and always has the value 0
#define MATCHED                       0x01000000      // Comparator match
#define Reserved                      0x07800000      // This read-only field is reserved and always has the value 0
#define Reserved                      0x00780000      // This read-only field is reserved and always has the value 0
#define DATAVADDR0                    0x00078000      // Data Value Address 0
#define DATAVSIZE                     0x00001800      // Data Value Size
#define Reserved                      0x00000200      // This read-only field is reserved and always has the value 0
#define DATAVMATCH                    0x00000100      // Data Value Match
#define Reserved                      0x00000780      // This read-only field is reserved and always has the value 0
#define FUNCTION                      0x00000078      // Selects the action taken on a comparator match


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_FCT1 register.
//
//*****************************************************************************

#define Reserved                      0x3F80000000      // This read-only field is reserved and always has the value 0
#define MATCHED                       0x01000000      // Comparator match
#define Reserved                      0x7FFFF800000      // This read-only field is reserved and always has the value 0
#define FUNCTION                      0x00000078      // Selects the action taken on a comparator match


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_TBCTRL register.
//
//*****************************************************************************

#define NUMCOMP                       0x780000000      // Number of Comparators
#define Reserved                      0x1FFFFFF8000000      // This read-only field is reserved and always has the value 0
#define ACOMP1                        0x00000002      // Action based on Comparator 1 match
#define ACOMP0                        0x00000001      // Action based on Comparator 0 match


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_DEVICECFG register.
//
//*****************************************************************************

#define DEVICECFG                     0x7FFFFFFF80000000      // Hardwired to 0x0000_0000


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_DEVICETYPID register.
//
//*****************************************************************************

#define DEVICETYPID                   0x7FFFFFFF80000000      // Hardwired to 0x0000_0004


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_PERIPHIDn register.
//
//*****************************************************************************

#define PERIPHID                      0x7FFFFFFF80000000      // Peripheral ID1 is hardwired to 0x0000_00E0; ID2 to 0x0000_0008; and all the others to 0x0000_0000


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_COMPIDn register.
//
//*****************************************************************************

#define COMPID                        0x7FFFFFFF80000000      // Component ID0 is hardwired to 0x0000_000D; ID1 to 0x0000_0090; ID2 to 0x0000_0005; ID3 to 0x0000_00B1


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_ENTRYn register.
//
//*****************************************************************************

